In [1]:
#Lab2
#Class:ELEC4511 HardwareSoftware
#Name:Fuwei Huang,Claire Charlton,John Milner

In [2]:
import json
import ast
import pandas as pd
from pandas import DataFrame

In [3]:
#Part 1
class Rectangle():
    def __init__(self,length,width):
        self.length=length
        self.width=width
    def rectangle_area(self):
        self.area=self.length * self.width #Calculate area
        return self.area
newRectangle=Rectangle(12,10)
print(newRectangle.rectangle_area())

120

In [4]:
#Part 2
class Circle ():
    def __init__(self,radius):
        self.radius=radius
    def areas(self):
        self.area=3.14*(self.radius**2) #Calculate area
        return self.area
    def circumference(self):
        self.circu=2*3.14*self.radius #Calculate Circumference
        return self.circu
NewCircle= Circle(8)
print(NewCircle.areas())
print(NewCircle.circumference())

200.96
50.24

In [5]:
#Problem 2
def create_json():
    user_value={}
    while True:
        value=input('Enter an item or type "done" to quit:\n')
        if value == 'done':
            break
        else:
            newdict=json.loads(value) #Convert it to dict form
            user_value.update(newdict) #Update the dict
    with open('information.json',"w") as f:
        f.write(json.dumps(user_value)) #Write to the Json file
    return user_value

In [6]:
create_json()

Enter an item or type "done" to quit:
{"1":{"class":"Hardware and Software", "Name":"Rohit", "Score":99}}
Enter an item or type "done" to quit:
{"2":{"class":"Logic Lab", "Name":"Tom", "Score":88}}
Enter an item or type "done" to quit:
{"3":{"class":"Computer Vision", "Name":"Jack", "Score":98}}
Enter an item or type "done" to quit:
done

{'1': {'class': 'Hardware and Software', 'Name': 'Rohit', 'Score': 99},
 '2': {'class': 'Logic Lab', 'Name': 'Tom', 'Score': 88},
 '3': {'class': 'Computer Vision', 'Name': 'Jack', 'Score': 98}}

In [7]:
#Problem 3- Part1
def read_comp():
    data=pd.read_excel('employee.xlsx',sheet_name='Sheet1')
    filterdata=data[data['hire_date']> '2007-01-01'] #Set the range
    frame=DataFrame(filterdata) #Convert it to dataframe
    return frame
read_comp()

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10

In [8]:
#Problem 3- Part2
#sort by hiring_date of emp_id? the expoutput is sort by emp_id.
def sortdate():
    data=pd.read_excel('employee.xlsx',sheet_name='Sheet1')
    data["hire_date"] = pd.to_datetime(data["hire_date"]) #Convert argument to datetime
    data=data.sort_values(by="hire_date") #Sort by the hire date
    return data
sortdate()

    emp_id   first_name   last_name  hire_date
2      102          Lex     De Haan 2001-01-13
9      109       Daniel      Faviet 2002-08-16
8      108        Nancy   Greenberg 2002-08-17
14     114          Den    Raphaely 2002-12-07
15     115    Alexander        Khoo 2003-05-18
0      100       Steven        King 2003-06-17
5      105        David      Austin 2005-06-25
17     117        Sigal      Tobias 2005-07-24
1      101        Neena     Kochhar 2005-09-21
10     110         John        Chen 2005-09-28
11     111       Ismael     Sciarra 2005-09-30
16     116       Shelli       Baida 2005-12-24
3      103    Alexander      Hunold 2006-01-03
6      106        Valli   Pataballa 2006-02-05
12     112  Jose Manuel       Urman 2006-03-07
18     118          Guy      Himuro 2006-11-15
7      107        Diana     Lorentz 2007-02-07
4      104        Bruce       Ernst 2007-05-21
19     119        Karen  Colmenares 2007-08-10
13     113         Luis        Popp 2007-12-07

In [9]:
#Problem 3- Part3
def filterdate():
    data=pd.read_excel('employee.xlsx',sheet_name='Sheet1')
    filterdata=data[(data['hire_date']> '2005-01-01') & (data['hire_date'] < '2006-12-01')] #Set the range for hire date
    frame=DataFrame(filterdata)
    return frame
filterdate()

    emp_id   first_name  last_name  hire_date
1      101        Neena    Kochhar 2005-09-21
3      103    Alexander     Hunold 2006-01-03
5      105        David     Austin 2005-06-25
6      106        Valli  Pataballa 2006-02-05
10     110         John       Chen 2005-09-28
11     111       Ismael    Sciarra 2005-09-30
12     112  Jose Manuel      Urman 2006-03-07
16     116       Shelli      Baida 2005-12-24
17     117        Sigal     Tobias 2005-07-24
18     118          Guy     Himuro 2006-11-15

In [10]:
#Problem 3- Part4
def setindex():
    data=pd.read_excel('employee.xlsx',sheet_name='Sheet1')
    data=data.set_index('hire_date') #Set the index
    return data
setindex()

            emp_id   first_name   last_name
hire_date
2003-06-17     100       Steven        King
2005-09-21     101        Neena     Kochhar
2001-01-13     102          Lex     De Haan
2006-01-03     103    Alexander      Hunold
2007-05-21     104        Bruce       Ernst
2005-06-25     105        David      Austin
2006-02-05     106        Valli   Pataballa
2007-02-07     107        Diana     Lorentz
2002-08-17     108        Nancy   Greenberg
2002-08-16     109       Daniel      Faviet
2005-09-28     110         John        Chen
2005-09-30     111       Ismael     Sciarra
2006-03-07     112  Jose Manuel       Urman
2007-12-07     113         Luis        Popp
2002-12-07     114          Den    Raphaely
2003-05-18     115    Alexander        Khoo
2005-12-24     116       Shelli       Baida
2005-07-24     117        Sigal      Tobias
2006-11-15     118          Guy      Himuro
2007-08-10     119        Karen  Colmenares

In [11]:
#Problem 3- Part5
def combinesheet():
    all_dfs = pd.read_excel('employee.xlsx', sheet_name=None)#None read in all the sheet
    data = pd.concat(all_dfs, ignore_index=True) #Combine all sheet
    data.to_excel('employee_new.xlsx',sheet_name='Sheet1') #Write to the new excel file
    return data
combinesheet()

    emp_id   first_name    last_name  hire_date
0      100       Steven         King 2003-06-17
1      101        Neena      Kochhar 2005-09-21
2      102          Lex      De Haan 2001-01-13
3      103    Alexander       Hunold 2006-01-03
4      104        Bruce        Ernst 2007-05-21
5      105        David       Austin 2005-06-25
6      106        Valli    Pataballa 2006-02-05
7      107        Diana      Lorentz 2007-02-07
8      108        Nancy    Greenberg 2002-08-17
9      109       Daniel       Faviet 2002-08-16
10     110         John         Chen 2005-09-28
11     111       Ismael      Sciarra 2005-09-30
12     112  Jose Manuel        Urman 2006-03-07
13     113         Luis         Popp 2007-12-07
14     114          Den     Raphaely 2002-12-07
15     115    Alexander         Khoo 2003-05-18
16     116       Shelli        Baida 2005-12-24
17     117        Sigal       Tobias 2005-07-24
18     118          Guy       Himuro 2006-11-15
19     119        Karen   Colmenares 2007-08-10
20     120      Matthew        Weiss 2004-07-18
21     121         Adam        Fripp 2005-04-10
22     122        Payam     Kaufling 2003-05-01
23     123       Shanta      Vollman 2005-10-10
24     124        Kevin      Mourgos 2007-11-16
25     125        Julia        Nayer 2005-07-16
26     126        Irene  Mikkilineni 2006-09-28
27     127        James       Landry 2007-01-14
28     128       Steven       Markle 2008-03-08
29     129        Laura       Bissot 2005-08-20
30     130        Mozhe     Atkinson 2005-10-30
31     131        James       Marlow 2005-02-16
32     132           TJ        Olson 2007-04-10
33     133        Jason       Mallin 2004-06-14
34     134      Michael       Rogers 2006-08-26
35     135           Ki          Gee 2007-12-12
36     136        Hazel   Philtanker 2008-02-06
37     137       Renske       Ladwig 2003-07-14
38     138      Stephen       Stiles 2005-10-26
39     141       Trenna         Rajs 2003-10-17
40     142       Curtis       Davies 2005-01-29
41     143      Randall        Matos 2006-03-15
42     144        Peter       Vargas 2006-07-09
43     145         John      Russell 2004-10-01
44     146        Karen     Partners 2005-01-05
45     147      Alberto    Errazuriz 2005-03-10
46     148       Gerald    Cambrault 2007-10-15
47     149        Eleni      Zlotkey 2008-01-29